/* OSStatus Descriptions. */

/* The key is the OSStatus error code, formatted as a signed integer */
/* The value is a brief human-readable description of the error code. */

0 = "No error";

-50 = "Invalid parameter(s)";
-200 = "Hardware not found";
-201 = "Not enough hardware available";
-128 = "User cancelled";
-1 = "Queue element not found during deletion";
-2 = "Invalid queue element";
-3 = "Core routine number out of range";
-4 = "Unimplemented";
-5 = "Invalid queue element";
-8 = "No debugger available";
-17 = "Control error";
-18 = "Status error";
-19 = "Read error";
-20 = "Write error";
-21 = "Bad unit";
-22 = "Unit empty";
-23 = "Open error";
-24 = "Close error";
-25 = "Driver remove error (still in use)";
-26 = "Driver install failed";
  
-25291 = "No trust results are available";
-25292 = "A read-only error occurred";
-25293 = "Authorization or authentication failed";
-25294 = "The keychain does not exist";
-25295 = "The keychain is not valid";
-25296 = "A keychain with the same name already exists";
-25299 = "An item with the same primary key attributes already exists";
-25300 = "The item cannot be found";
-25301 = "The buffer is too small";
-25302 = "The data is too large for the particular data type";
-25303 = "The attribute does not exist";
-25304 = "The item object is invalid";
-25305 = "The search object is invalid";
-25306 = "The specified item does not appear to be a valid keychain item";
-25307 = "A default keychain does not exist";
-25308 = "Interaction with the user is required in order to grant access or process a request; however, user interaction with the Security Server has been disabled by the program";
-25309 = "The attribute is read-only";
-25310 = "The version is incorrect";
-25311 = "The key size is not allowed";
-25312 = "No storage module is available";
-25313 = "No certificate module is available";
-25314 = "No policy module is available";
-25315 = "Interaction with the user is required in order to grant access or process a request; however, user interaction with the Security Server is impossible because the program is operating in a session incapable of graphics (such as a root session or ssh session)";
-25316 = "The data is not available";
-25317 = "The data is not modifiable";
-25318 = "One or more certificates required in order to validate this certificate cannot be found";
-25319 = "The preference domain specified is invalid. This error can occur in Mac OS X v10.3 and later";
-25240 = "The access control list is not in standard simple form";
-25241 = "The policy specified cannot be found";
-25242 = "The trust setting is invalid";
-25243 = "The specified item has no access control";
-25244 = "An invalid attempt has been made to change the owner of an item";
-25245 = "No trust results are available";
